==========
note
==========

@startuml
Alice->Bob : hello
note left: this is a first note

Bob->Alice : ok
note right: this is another note

Bob->Bob : I am thinking
note left
a note
can also be defined
on several lines
end note
@enduml

----

(diagram
  (uml
    (expression
      (sequence_diagram
        (left)
        (connector)
        (right)
        (activity)))
    (expression
      (note_block
        (line)
        (line)
        (line)
        (line)
        (line)
        (line)
        (line)
        (line)))))
