===============
simple
===============

@startuml
Alice -> Bob: Authentication Request
Bob --> Alice: Authentication Response

Alice -> Bob: Another authentication Request
Alice <-- Bob: Another authentication Response
@enduml

---

(diagram
  (uml
    (expression
      (sequence_diagram
        (left)
        (to_right)
        (right)
        (activity)))
    (expression
      (sequence_diagram
        (left)
        (to_right_dotted)
        (right)
        (activity)))
    (expression
      (sequence_diagram
        (left)
        (to_right)
        (right)
        (activity)))
    (expression
      (sequence_diagram
        (left)
        (to_left_dotted)
        (right)
        (activity)))))

=============
alias
=============

@startuml
participant Participant as Foo
actor       Actor       as Foo1
boundary    Boundary    as Foo2
control     Control     as Foo3
entity      Entity      as Foo4
database    Database    as Foo5
collections Collections as Foo6
queue       Queue       as Foo7
Foo -> Foo1 : To actor
Foo -> Foo2 : To boundary
Foo -> Foo3 : To control
Foo -> Foo4 : To entity
Foo -> Foo5 : To database
Foo -> Foo6 : To collections
Foo -> Foo7: To queue
@enduml

----

(diagram
  (uml
    (expression
      (attribute
        (kind)
        (name)
        (attr_alias
          (new_name))))
    (expression
      (attribute
        (kind)
        (name)
        (attr_alias
          (new_name))))
    (expression
      (attribute
        (kind)
        (name)
        (attr_alias
          (new_name))))
    (expression
      (attribute
        (kind)
        (name)
        (attr_alias
          (new_name))))
    (expression
      (attribute
        (kind)
        (name)
        (attr_alias
          (new_name))))
    (expression
      (attribute
        (kind)
        (name)
        (attr_alias
          (new_name))))
    (expression
      (attribute
        (kind)
        (name)
        (attr_alias
          (new_name))))
    (expression
      (attribute
        (kind)
        (name)
        (attr_alias
          (new_name))))
    (expression
      (sequence_diagram
        (left)
        (to_right)
        (right)
        (activity)))
    (expression
      (sequence_diagram
        (left)
        (to_right)
        (right)
        (activity)))
    (expression
      (sequence_diagram
        (left)
        (to_right)
        (right)
        (activity)))
    (expression
      (sequence_diagram
        (left)
        (to_right)
        (right)
        (activity)))
    (expression
      (sequence_diagram
        (left)
        (to_right)
        (right)
        (activity)))
    (expression
      (sequence_diagram
        (left)
        (to_right)
        (right)
        (activity)))
    (expression
      (sequence_diagram
        (left)
        (to_right)
        (right)
        (activity)))))

===========
color
===========

@startuml
actor Bob #red
participant Alice
participant "I have a really\nlong name" as L #99FF99

Alice->Bob: Authentication Request
Bob->Alice: Authentication Response
Bob->L: Log transaction
@enduml

----

(diagram
  (uml
    (expression
      (attribute
        (kind)
        (name)
        (color)))
    (expression
      (attribute
        (kind)
        (name)))
    (expression
      (attribute
        (kind)
        (name
          (string
            (escape_char)))
        (attr_alias
          (new_name))
        (color)))
    (expression
      (sequence_diagram
        (left)
        (to_right)
        (right)
        (activity)))
    (expression
      (sequence_diagram
        (left)
        (to_right)
        (right)
        (activity)))
    (expression
      (sequence_diagram
        (left)
        (to_right)
        (right)
        (activity)))))

===========
comment
===========

@startuml
actor Bob #red
' The only difference between actor
'and participant is the drawing
participant Alice
participant "I have a really\nlong name" as L #99FF99
/' You can also declare:
   participant L as "I have a really\nlong name"  #99FF99
  '/

Alice->Bob: Authentication Request
Bob->Alice: Authentication Response
Bob->L: Log transaction
@enduml

----

(diagram
  (uml
    (expression
      (attribute
        (kind)
        (name)
        (color)))
    (comment)
    (comment)
    (expression
      (attribute
        (kind)
        (name)))
    (expression
      (attribute
        (kind)
        (name
          (string
            (escape_char)))
        (attr_alias
          (new_name))
        (color)))
    (comment)
    (expression
      (sequence_diagram
        (left)
        (to_right)
        (right)
        (activity)))
    (expression
      (sequence_diagram
        (left)
        (to_right)
        (right)
        (activity)))
    (expression
      (sequence_diagram
        (left)
        (to_right)
        (right)
        (activity)))))

=======
order
=======

@startuml
participant Last order 30
participant Middle order 20
participant First order 10
@enduml

----

(diagram
  (uml
    (expression
      (attribute
        (kind)
        (name)
        (attr_order
          (value))))
    (expression
      (attribute
        (kind)
        (name)
        (attr_order
          (value))))
    (expression
      (attribute
        (kind)
        (name)
        (attr_order
          (value))))))

===========
multiline
===========

@startuml
participant Participant [
    =Title
    ----
    ""打算""
]

participant Bob

Participant -> Bob
@enduml

----

(diagram
  (uml
    (expression
      (attribute
        (kind)
        (name)
        (multiline)))
    (expression
      (attribute
        (kind)
        (name)))
    (expression
      (sequence_diagram
        (left)
        (to_right)
        (right)))))

================
non letter
================

@startuml
Alice -> "Bob()" : Hello
"Bob()" -> "This is very\nlong" as Long
' You can also declare:
' "Bob()" -> Long as "This is very\nlong"
Long --> "Bob()" : ok
@enduml

----

(diagram
  (uml
    (expression
      (sequence_diagram
        (left)
        (to_right)
        (right
          (string))
        (activity)))
    (expression
      (sequence_diagram
        (left
          (string))
        (to_right)
        (right
          (string
            (escape_char)))
        (attr_alias
          (new_name))))
    (comment)
    (comment)
    (expression
      (sequence_diagram
        (left)
        (to_right_dotted)
        (right
          (string))
        (activity)))))
